from string import Template


### RAG PROMPTS ###

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد لتوليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "عليك توليد إجابة بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة.",
    "عليك توليد الإجابة بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا في إجابتك. تجنب المعلومات غير الضرورية."
]))

#### Document ####

document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)

#### Footer ####

footer_prompt = Template("\n".join([
    "استنادًا فقط إلى المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
    "## السؤال: $query",
    "",
    "## الإجابة: "
]))